%%albedo vs rad

close all
clc
format long

%%INITIAL CONDITIONS

thetaa1 = 500; % начальная температура
w = 2*pi*1/4/3600; %частота
t = 0:10:3600; %время
q1rad = 20000; %%переменная лучистая компонента
k = 1; %% показатель поглощения
sigma = 100; %% показатель рассеяния
B = 200; %%коэффициент теплоотдачи воздушная среда-поверхность
b = sqrt(k*k+k*sigma);
A = (b-k)/(b+k); %% альбедо
c = 450; %%теплоёмкость
rho = 1000; %%плотность
Kt = 0.1; %% коэффициент теплопроводности
at = Kt/c/rho; %%коэффициент температуропроводности
z = 0:0.0005:0.01;
deltaphi_rad_conv = 0;



phi = 0:pi/72*pi/72:pi/2*pi/2;


%Пористый 

c = 450; %%теплоёмкость
rho = 1000; %%плотность
Kt = 0.1; %% коэффициент теплопроводности
at = Kt/c/rho; %%коэффициент температуропроводности

phi = sqrt(phi);

t(1)=3600;
t(2)=3600/2;
t(3)=3600/4;
b=zeros(4,length(phi));


Kt = 2; %% коэффициент теплопроводности
at2 = Kt/c/rho; %%коэффициент температуропроводности

%Пористый 
b(1,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at*t(1)));
b(2,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at*t(2))); %% 3.32 показатель ослабления излучения светорассеивающей среды в условиях многократного рассения.

%Монолитный
b(3,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at2*t(1)));
b(4,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at2*t(2))); %% 3.32 показатель ослабления излучения светорассеивающей среды в условиях многократного рассения.

A=zeros(16,length(phi)); %альбедо, коэффициент отражения полубесконечного слоя вещества
k=zeros(2,1);
k(1,1)=1;
k(2,1)=2;

A(1,:)=(b(1,:)-1)./(b(1,:)+1);
A(2,:)=(b(2,:)-2)./(b(2,:)+2);

A(3,:)=(b(3,:)-1)./(b(3,:)+1);
A(4,:)=(b(4,:)-2)./(b(4,:)+2);

h = figure('rend','painters','pos',[100 100 650 700]) 

plot(phi,A(1,:).*100,'r'); %1a
hold on
plot(phi,A(2,:).*100,'g'); %1b
hold on
plot(phi,A(3,:).*100,'b'); %2a
hold on
plot(phi,A(4,:).*100,'k'); %2b
hold on

%%at = 1e-6; %%коэффициент температуропроводности (лёд)
%%at2 = 5.7*1e-7; %%коэффициент температуропроводности (снег)

t(1)=3600*6;
t(2)=3600*3;
t(3)=3600*1.5;
b=zeros(4,length(phi));
b(1,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at*t(1)));
b(2,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at2*t(1))); %% 3.32 показатель ослабления излучения светорассеивающей среды в условиях многократного рассения.
b(3,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at*t(2)));
b(4,:)=sqrt(2*pi./(tan(phi)+1e-10)./(at2*t(2)));

A=zeros(16,length(phi)); %альбедо, коэффициент отражения полубесконечного слоя вещества
k=zeros(2,1);
k(1,1)=2;
k(2,1)=2;
%a
A(1,:)=(b(1,:)-2)./(b(1,:)+2); %3c
A(2,:)=(b(2,:)-2)./(b(2,:)+2); %3d
%b
A(3,:)=(b(3,:)-2)./(b(3,:)+2); %4c
A(4,:)=(b(4,:)-2)./(b(4,:)+2); %4d

%plot(phi,A(1,:).*100,'k'); %3c
%hold on
%plot(phi,A(2,:).*100,'k'); %3d
%hold on
%plot(phi,A(3,:).*100,'k'); %4c
%hold on
%plot(phi,A(4,:).*100,'k'); %4d
%
xlabel('{\it\phi}, rad');
ylabel('{\itAlbedo}, %');
set(gca, 'FontName', 'Arial')
set(gca, 'Position', [0.2 0.2 0.65 0.65])
set(gca, 'FontSize', 25);
set(gcf,'color','w');
set(gca,'XTick',0:pi/4:pi/2) 
set(gca,'XTickLabel',{'0','\pi/4','\pi/2'}) 
xlim([0 pi/2])
ylim([30 100])
set(gcf,'PaperPositionMode','auto')
print('tres1_comb','-dpng');
